// call.js
var express = require('express');
var app = express();
var expressWs = require('express-ws');
var fs = require('fs');
var http = require('http');
var https = require('https');
var qs = require('qs');
var path = require('path');
var dns = require('dns');
var axios = require('axios');
var nodeXlsx = require('node-xlsx');
var mammoth = require('mammoth');
var xlsx = require('xlsx');
var fs = require('fs');
var nodeXlsx = require('node-xlsx');
var path = require('path');
const exec = require('child_process').exec;
const execSync = require('child_process').execSync;
// fs.readdir('./table', (err, files) => {
// 	console.log(files.length);
// });
// console.log(process.env.NODE_OPTIONS);
// var sheets = nodeXlsx.parse(
// 	fs.readFileSync(path.join(__dirname, './工作簿1.xlsx'))
// );
// fs.writeFile(`test.json`, JSON.stringify(sheets), (res) => {
// 	console.log('write success');
// });

var private_obj = [
	{
		name: '基础项目',
		children: [
			{
				name: '一般检查',
				children: [
					{
						name: '身高、体重、血压',
						price: 3,
						according:
							'通过测量身高、体重、血压可评价血压与体重是否正常，测定体重指数，可初步筛查高血压病',
					},
					{
						name: '内科',
						price: 5,
						according:
							'通过体检医师对人体视、触、叩、听等物理方法，了解心界是否扩大，心率快慢，心律是否整齐，心音改变，心脏有无杂音；肺部呼吸音是否正常，有无干、湿罗音；哮鸣音；肝脾是否肿大，如有肿大，其表面是否光滑、质地软硬程度、有无叩触痛及叩痛，肠鸣音是否正常，腹部有无包块，神经反射是否正常，可筛查诊断：先天性心脏病、肺气肿、肺炎、肝硬化、肝炎、胆囊炎、脾肿大、肾炎等疾病',
					},
					{
						name: '外科',
						price: 0,
						according:
							'通过体检医师对人体皮肤、脊柱、四肢、淋巴结、甲状腺、乳腺、泌尿生殖、前列腺、肛门等项的检查可筛查诊断：皮肤病、淋巴结肿大、甲状腺炎、甲状腺肿、乳腺炎、脊柱畸形、关节炎、肩周炎、痔疮、前列腺炎等疾病',
					},
					{
						name: '耳鼻喉科',
						price: 0,
						according:
							'通过对听力、外耳道、鼓膜、鼻窦、鼻腔、咽喉、扁桃体的检查，可筛查：中耳炎、耳鸣、耳聋、慢性中耳炎、慢性鼻炎、慢性鼻窦炎、变应性鼻炎、鼻出血，鼻中膈偏曲、鼻炎癌、咽炎、喉炎、扁桃体炎等疾病',
					},
					{
						name: '口腔科',
						price: 0,
						according:
							'通过对口腔唇、腭、齿、牙龈、黏膜、舌的检查可筛查：龋齿、牙周炎、牙髓炎、口腔癌等疾病',
					},
					{
						name: '眼科',
						price: 0,
						according:
							'通过对视力、辨色力、结膜、角膜、眼睑、瞳孔眼球运动功能的检查，可筛查：近视、远视、散光色盲、沙眼、结膜炎、角膜炎等疾病',
					},
				],
			},
			{
				name: '实验室检查',
				children: [
					{
						name: '血常规',
						price: 0,
						according:
							'通过血液分析可发现有无贫血、细菌感染、病毒感染、白血病、败血病等血液方面疾病，对机体其他器官的病变，也具有重要的诊断价值（包括红细胞、白细胞、淋巴细胞、单核细胞、中性粒细胞、血小板、血红蛋白、血色素主要检查内容）',
					},
					{
						name: '尿常规',
						price: 0,
						according:
							'通过对尿液的检查分析，可以诊断泌尿系统疾病，如结核、肾炎、肿瘤、结石、血管病变，还可以协助诊断其他系统疾病，如糖尿病、急性胰腺炎、急性或慢性溶血、多发性骨髓瘤、急性汞中毒等（包括酸碱度、蛋白尿、尿糖等）',
					},
					{
						name: '乙肝五项（定性）',
						price: 0,
						according:
							'乙肝表面抗原、乙肝表面抗体、乙肝e抗原、乙肝e抗体、乙肝核心抗体、;可筛查是否感染乙肝病毒，是否产生肝炎病毒的抗体，是否应注射疫苗和注射疫苗的效果',
					},
					{
						name: '肝功五项',
						price: 0,
						according:
							'谷丙转氨酶、谷草转氨酶、总胆红素、碱性磷酸酶、r-谷氨酰基转移酶;通过血液生化分析可反映目前肝细胞的新陈代谢状态，可筛查肝、胆功能异常、急（慢）性肝炎，黄疸肝炎、肝硬化、肝癌、心肌炎、肾炎等脏器疾病',
					},
					{
						name: '肾功五项',
						price: 0,
						according:
							'尿素氮 、尿酸、肌酐、胱抑素C;通过血液检查可筛查肾脏是否受损，是否有急（慢）性肾炎疾病及痛风、高尿酸血症等',
					},
					{
						name: '空腹血糖',
						price: 0,
						according:
							'通过血液检测可了解血液中葡萄糖的含量，是筛查糖尿病最基本的方法，也是判断糖尿病病情控制程度及进行饮食指导的主要指标',
					},
					{
						name: '血脂四项',
						price: 0,
						according:
							'甘油三酯、总胆固醇、高密度脂蛋白 、低密度脂蛋白;通过血液检查可了解血液中的脂肪的含量，筛查是否有高血脂症，对高血压、糖尿病、动脉硬化、心肌梗塞、脑卒中、肥胖症、冠心病、肾病综合症有较高诊断价值',
					},
				],
			},
			{
				name: '肿瘤筛查',
				children: [
					{
						name: '癌胚抗原',
						price: 0,
						according:
							'通过血液检查可筛可结肠癌、胃癌、肺癌、胆囊癌、是直肠癌和结肠癌标志物检查',
					},
					{
						name: '甲胎蛋白',
						price: 0,
						according:
							'甲胎蛋白与肝癌及多种肿瘤的发生发展密切相关，在多种肿瘤中均可表现出较高浓度，可作为多种肿瘤的阳性检测指标。',
					},
				],
			},
			{
				name: '仪器检查',
				children: [
					{
						name: '心电图',
						price: 0,
						according:
							'有无心肌缺血、心律失常等、心肌肥大、心梗、心肌炎、传导阻滞等',
					},
					{
						name: 'DR胸部正位片',
						price: 0,
						according:
							'通过DR胸部摄片可使受检部位的影像永久保留在胶片上，而且比透视更清晰，供以后检查对照；可筛查：肺结核、肺肿瘤、胸腔积液、气胸、支气管炎、肺炎、肺气肿、胸膜疾病、纵隔疾病、心脏疾病（如高心病、肺心病、风心病、先心病等）及主动脉疾病',
					},
					{
						name: 'DR颈椎正侧位片',
						price: 0,
						according:
							'通过DR摄片可筛查颈椎有无骨质病变，关节关系是否正常，椎间孔大小有无异常，颈椎生理弯曲是否存在',
					},
					{
						name: '上腹部彩超男',
						price: 0,
						according:
							'彩色超声较黑白超声检查更清楚。通过超声波影像检查，对人体腹腔内肝、胆、肾、胰、脾、血管等器官的内部结构、形态进行检查可筛查：脂肪肝、结石、囊肿、肿瘤、血管瘤、肝硬化、肾实质病变，是腹部脏器必查的项目',
					},
					{
						name: '盆腔彩超男',
						price: 0,
						according:
							'通过超声影像检查对男性前列腺等部位检查可筛查前列腺增生、前列腺炎、前列腺癌、前列腺囊肿、前列腺脓肿、前列腺结核、前列腺结石；',
					},
				],
			},
			{
				name: '妇科检查',
				children: [
					{
						name: '乳腺彩超',
						price: 0,
						according:
							'乳房超声波检查囊肿或良性纤维瘤的准确性比摄影高，是对年轻、未停经或乳腺密度高的女士最有效的检查方法',
					},
					{
						name: '妇科常规检查',
						price: 0,
						according:
							'妇科体检医师通过问诊女性月经史、手术史、孕产史、及对外阴、阴道分泌物、宫颈、宫体、附件的检查，可了解女性子宫大小、形态及位置有无异常，可筛查：阴道炎、宫颈糜烂、附件炎、盆腔炎等疾病',
					},
					{
						name: '白带常规',
						price: 0,
						according:
							'通过显微镜对阴道分泌物的检查确定阴道清洁程度、寻找病原体，确定阴道炎症性质（霉菌、滴虫）可筛查妇科炎症',
					},
					{
						name: '宫颈刮片',
						price: 0,
						according:
							'通过显微镜对宫颈刮片的病理检查是筛查子宫颈癌，是最有效的检查方法之一。凡有过性行为的女性，每年至少检查一次',
					},
					{
						name: '上腹部彩超女',
						price: 0,
						according:
							'彩色超声较黑白超声检查更清楚。通过超声波影像检查，对人体腹腔内肝、胆、肾、胰、脾、血管等器官的内部结构、形态进行检查可筛查：脂肪肝、结石、囊肿、肿瘤、血管瘤、肝硬化、肾实质病变，是腹部脏器必查的项目',
					},
					{
						name: '妇科彩超',
						price: 0,
						according:
							'通过超声影像检查对女性子宫、卵巢、输卵管等部位检查可筛查子宫肌瘤、子宫纤维瘤、子宫癌、子宫内膜增生、子宫内膜癌、卵巢囊肿、卵巢癌等疾病',
					},
				],
			},
		],
	},
	{
		name: '年龄加项',
		children: [
			{
				name: '35岁以下',
				children: [
					{
						name: '基础套餐项目，无加项，',
						price: 0,
						according: '',
					},
				],
			},
			{
				name: '35到45岁',
				children: [
					{
						name: 'DR颈椎正侧位片',
						price: 0,
						according:
							'通过ＤＲ摄片可筛查颈椎有无骨质病变，关节关系是否正常，椎间孔大小有无异常，颈椎生理弯曲是否存在',
					},
					{
						name: '甲状腺彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可筛查甲状腺肿、甲状腺囊肿、甲状腺炎、甲状腺瘤、甲状腺癌等疾病',
					},
					{
						name: 'PSA',
						price: 0,
						according:
							'前列腺癌患者PSA血清浓度明显升高，故作为前列腺癌的首选标志物，是前列腺癌早期诊断和筛选指标，也用于前列腺癌的病情变化以及治疗效果的跟踪',
					},
					{
						name: 'CA125',
						price: 0,
						according:
							'CA125是卵巢癌的首选标志物，特异性可达97％，通过血液检查可筛查卵巢癌，子宫内膜癌。它和肿瘤的复发有关，因此也是二次复发治疗的重要指标；',
					},
					{
						name: 'CA153',
						price: 0,
						according:
							'CA15-3是乳腺癌的主要标志物，对乳腺癌的敏感性和特异性较高，主要用于跟踪乳腺癌的病情发展和治疗效果的观察',
					},
				],
			},
			{
				name: '45岁以上',
				children: [
					{
						name: '甲功五项',
						price: 0,
						according:
							'甲状腺素（T4）、三碘甲状腺原氨酸（T3）、促甲状腺素、游离T3、游离T4;通过血液检测可筛查人体甲状腺功能状态，是否有甲低或甲亢',
					},
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
					{
						name: '颈部血管彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可发现颈动脉是否有狭窄、硬化及闭塞，是否有粥样斑块，图像很直观',
					},
					{
						name: '骨密度',
						price: 0,
						according: '有无骨量减少、骨质疏松',
					},
					{
						name: 'HP',
						price: 0,
						according:
							'是否存在幽门螺杆菌感染，（定性）。（此菌与久治不愈的胃炎、溃疡病有关，并确认是人类患胃癌的Ⅰ类致癌原）',
					},
				],
			},
		],
	},
	{
		name: '既往病史及异常指标加项',
		children: [
			{
				name: '高血压',
				children: [
					{
						name: '眼底检查',
						price: 0,
						according:
							'眼底检查是一项非常重要的检查，眼底视网膜血管是全身唯一可用肉眼直接观察到的末梢血管，其状况对全身系统性疾病、高血压病、糖尿病等的诊断及治疗都有极其重要的意义。通过对玻璃体、视网膜、视神经乳头、脉络膜等检查，可筛查出青光眼、白内障、视神经炎、视神经萎缩、眼底动脉硬化等疾病',
					},
					{
						name: 'B2-微球蛋白',
						price: 0,
						according:
							'见于近端肾小管损害、急性或慢性肾小球肾炎、自身免疫性疾病、恶性肿瘤、肝病、艾滋病等，特别是衡量糖尿病患者轻度肾功能减退和疗效观察的一项简便、精确而敏感的方法',
					},
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
					{
						name: '高血压五项',
						price: 0,
						according:
							'排除是否是由于继发因素所导致的血压升高，如原发性醛固酮增多症、肾上腺皮质增生等',
					},
					{
						name: '动脉硬化检测',
						price: 0,
						according:
							'针对血管的早期功能性检测，较传统的检查如影像、超声、介入等系统提早5到10年了解血管变化情况。 欧美国家将其作为高血压病预防指南，中国卫生部将其列入十年百项计划',
					},
					{
						name: '同型半胱氨酸',
						price: 0,
						according:
							'为心血管疾病，尤其是冠状动脉粥样硬化和心肌梗塞的危险性评价指标，其浓度升高程度与疾病的危险性成正比。',
					},
				],
			},
			{
				name: '糖尿病',
				children: [
					{
						name: '糖化血红蛋白',
						price: 0,
						according:
							'是人体血液中红细胞内的血红蛋白与血糖综合的产物，衡量糖尿病控制水平，可以稳定可靠地反映出检测前120天内的平均血糖水平，不受抽血时间、是否空腹，是否使用胰岛素等因素影响，是国际公认的糖尿病监控金指标',
					},
					{
						name: '眼底检查',
						price: 0,
						according:
							'眼底检查是一项非常重要的检查，眼底视网膜血管是全身唯一可用肉眼直接观察到的末梢血管，其状况对全身系统性疾病、高血压病、糖尿病等的诊断及治疗都有极其重要的意义。通过对玻璃体、视网膜、视神经乳头、脉络膜等检查，可筛查出青光眼、白内障、视神经炎、视神经萎缩、眼底动脉硬化等疾病',
					},

					{
						name: 'B2-微球蛋白',
						price: 0,
						according:
							'见于近端肾小管损害、急性或慢性肾小球肾炎、自身免疫性疾病、恶性肿瘤、肝病、艾滋病等，特别是衡量糖尿病患者轻度肾功能减退和疗效观察的一项简便、精确而敏感的方法',
					},
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
					{
						name: '同型半胱氨酸',
						price: 0,
						according:
							'为心血管疾病，尤其是冠状动脉粥样硬化和心肌梗塞的危险性评价指标，其浓度升高程度与疾病的危险性成正比。',
					},
				],
			},
			{
				name: '高血脂',
				children: [
					{
						name: '血流变检测',
						price: 0,
						according:
							'通过血液检查可测定血液粘度反映血液在体内的流动性及供应状况，解释由于血液粘度增加而导致的疾病，如血栓病及高黏滞综合症',
					},
					{
						name: '颈部血管彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可发现颈动脉是否有狭窄、硬化及闭塞，是否有粥样斑块，图像很直观',
					},
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
				],
			},
			{
				name: '心血管疾病',
				children: [
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
					{
						name: '颈部血管彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可发现颈动脉是否有狭窄、硬化及闭塞，是否有粥样斑块，图像很直观',
					},

					{
						name: '同型半胱氨酸',
						price: 0,
						according:
							'为心血管疾病，尤其是冠状动脉粥样硬化和心肌梗塞的危险性评价指标，其浓度升高程度与疾病的危险性成正比。',
					},

					{
						name: '心肌酶谱',
						price: 0,
						according:
							'检查心肌酶主要是确定心肌缺血坏死或细胞膜通透性，对诊断心肌损害，特别是急性心梗意义很大。',
					},
				],
			},
			{
				name: '脑血管疾病',
				children: [
					{
						name: '头颅MR',
						price: 0,
						according:
							'神经系统的MRI扫描是所有影像学检查中最有价值的。对于老年病、退行性病变、白质病变早期发现、早期诊断；脑梗塞灶的排查，梗塞治疗后恢复效果评估；排查脑部炎性改变、服用药物造成的白质损伤等，具有其他检查不可替代的意义',
					},
				],
			},
			{
				name: '慢性肺部疾病',
				children: [
					{
						name: '胸部CT',
						price: 0,
						according:
							'检查肺、气管、支气管、纵膈、胸膜、胸壁等部位的炎症，扩张、狭窄、阻塞、肥厚、淋巴结肿大、占位性病变等',
					},
					{
						name: '肺功能检查',
						price: 0,
						according:
							'通过肺功能仪实时监测人体气道阻力的变化，利用气道过敏反映测试系统检测、分析、评估，可了解人体肺活量，血液中血氧的含量，了解机体是否缺氧，可筛查肺气肿、肺不张等疾病',
					},
					{
						name: '肺活量检查',
						price: 0,
						according:
							'肺活量是指一次尽力吸气后，再尽力呼出的气体总量。肺活量是一次呼吸的最大通气量，在一定意义上可反映呼吸机能的潜在能力。健康状况愈好的人肺活量愈大，成年男子肺活量约为3500毫升，女子约为2500毫升。壮年人的肺活量最大，幼年和老年人较小。由于肺活量的测定方法简单，重复性较好，故是健康检查常用的指标。肺活量明显减小是限制性通气障碍的表现。肺组织损害如肺结核、肺纤维化、肺不张或肺叶切除达一定程度时都可能使肺活量减小；脊柱后凸，胸膜增厚，渗出性胸膜炎或气胸等，也可使肺扩张受限，肺活量减小',
					},
				],
			},
			{
				name: '高尿酸血症',
				children: [
					{
						name: '肾功五项',
						price: 0,
						according:
							'包括尿酸、肌酐、尿素氮、二氧化碳结合力、胱抑素c，如果有尿酸高容易导致痛风，引起痛风性肾病，胱抑速c是早期肾衰竭指标，尿素氮、肌酐升高明显，说明肾功能严重下降，二氧化碳结合力评判是否有代谢性酸中毒。',
					},
				],
			},
			{
				name: '肥胖',
				children: [
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
					{
						name: '同型半胱氨酸',
						price: 0,
						according:
							'为心血管疾病，尤其是冠状动脉粥样硬化和心肌梗塞的危险性评价指标，其浓度升高程度与疾病的危险性成正比。',
					},
				],
			},
			{
				name: '同型半胱氨酸偏高',
				children: [
					{
						name: '同型半胱氨酸',
						price: 0,
						according:
							'为心血管疾病，尤其是冠状动脉粥样硬化和心肌梗塞的危险性评价指标，其浓度升高程度与疾病的危险性成正比。',
					},

					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
				],
			},
			{
				name: '颈动脉粥样硬化斑块形成',
				children: [
					{
						name: '血流变检测',
						price: 0,
						according:
							'通过血液检查可测定血液粘度反映血液在体内的流动性及供应状况，解释由于血液粘度增加而导致的疾病，如血栓病及高黏滞综合症',
					},
					{
						name: '颈部血管彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可发现颈动脉是否有狭窄、硬化及闭塞，是否有粥样斑块，图像很直观',
					},
				],
			},
			{
				name: '空腹血糖偏高',
				children: [
					{
						name: '糖化血红蛋白',
						price: 0,
						according:
							'是人体血液中红细胞内的血红蛋白与血糖综合的产物，衡量糖尿病控制水平，可以稳定可靠地反映出检测前120天内的平均血糖水平，不受抽血时间、是否空腹，是否使用胰岛素等因素影响，是国际公认的糖尿病监控金指标',
					},
					{
						name: '糖耐量试验',
						price: 0,
						according:
							'了解人体对进食葡萄糖后的血糖调节能力，诊断糖尿病及其鉴别诊断',
					},
				],
			},
			{
				name: '血压偏高',
				children: [
					{
						name: '24h动态血压检测',
						price: 0,
						according:
							'早期高血压病的诊断；协助鉴别原发性、继发性和复杂高血压；指导合理用药，更好地预防心脑血管并发症的发生，预测高血压的并发症和死亡的发生和发展。',
					},
				],
			},
			{
				name: '动脉硬化',
				children: [
					{
						name: '动脉硬化检测',
						price: 0,
						according:
							'针对血管的早期功能性检测，较传统的检查如影像、超声、介入等系统提早5到10年了解血管变化情况。 欧美国家将其作为高血压病预防指南，中国卫生部将其列入十年百项计划',
					},
				],
			},
			{
				name: '窦性心律不齐',
				children: [
					{
						name: '24h动态心电图',
						price: 0,
						according:
							'能够记录全部的异常电波，能检出各类心律失常和病人在24h内各状态下所出现的有或无症状性心肌缺血，对心脏病的诊断提供精确可靠的依据 .在临床应用中，尤其对早期冠心病有较高的检出率。',
					},
					{
						name: '心脏彩超',
						price: 0,
						according:
							'心脏结构（心脏瓣膜、瓣膜环、心腔、心室壁等结构）主动脉血管及心脏功能情况',
					},
				],
			},
			{
				name: '支气管扩张',
				children: [
					{
						name: '肺功能检查',
						price: 0,
						according:
							'通过肺功能仪实时监测人体气道阻力的变化，利用气道过敏反映测试系统检测、分析、评估，可了解人体肺活量，血液中血氧的含量，了解机体是否缺氧，可筛查肺气肿、肺不张等疾病',
					},
					{
						name: '肺活量检查',
						price: 0,
						according:
							'肺活量是指一次尽力吸气后，再尽力呼出的气体总量。肺活量是一次呼吸的最大通气量，在一定意义上可反映呼吸机能的潜在能力。健康状况愈好的人肺活量愈大，成年男子肺活量约为3500毫升，女子约为2500毫升。壮年人的肺活量最大，幼年和老年人较小。由于肺活量的测定方法简单，重复性较好，故是健康检查常用的指标。肺活量明显减小是限制性通气障碍的表现。肺组织损害如肺结核、肺纤维化、肺不张或肺叶切除达一定程度时都可能使肺活量减小；脊柱后凸，胸膜增厚，渗出性胸膜炎或气胸等，也可使肺扩张受限，肺活量减小',
					},
					{
						name: '胸部高分辨CT',
						price: 0,
						according:
							'胸部高分辨CT主要用于肺部微小结构的显示，如小支气管、小血管，显示微小结节有很大的优点。',
					},
				],
			},
			{
				name: '肺大泡',
				children: [
					{
						name: '肺功能检查',
						price: 0,
						according:
							'通过肺功能仪实时监测人体气道阻力的变化，利用气道过敏反映测试系统检测、分析、评估，可了解人体肺活量，血液中血氧的含量，了解机体是否缺氧，可筛查肺气肿、肺不张等疾病',
					},
					{
						name: '肺活量检查',
						price: 0,
						according:
							'肺活量是指一次尽力吸气后，再尽力呼出的气体总量。肺活量是一次呼吸的最大通气量，在一定意义上可反映呼吸机能的潜在能力。健康状况愈好的人肺活量愈大，成年男子肺活量约为3500毫升，女子约为2500毫升。壮年人的肺活量最大，幼年和老年人较小。由于肺活量的测定方法简单，重复性较好，故是健康检查常用的指标。肺活量明显减小是限制性通气障碍的表现。肺组织损害如肺结核、肺纤维化、肺不张或肺叶切除达一定程度时都可能使肺活量减小；脊柱后凸，胸膜增厚，渗出性胸膜炎或气胸等，也可使肺扩张受限，肺活量减小',
					},
					{
						name: '胸部CT',
						price: 0,
						according:
							'检查肺、气管、支气管、纵膈、胸膜、胸壁等部位的炎症，扩张、狭窄、阻塞、肥厚、淋巴结肿大、占位性病变等',
					},
				],
			},
			{
				name: '肺气肿',
				children: [
					{
						name: '肺功能检查',
						price: 0,
						according:
							'通过肺功能仪实时监测人体气道阻力的变化，利用气道过敏反映测试系统检测、分析、评估，可了解人体肺活量，血液中血氧的含量，了解机体是否缺氧，可筛查肺气肿、肺不张等疾病',
					},
					{
						name: '肺活量检查',
						price: 0,
						according:
							'肺活量是指一次尽力吸气后，再尽力呼出的气体总量。肺活量是一次呼吸的最大通气量，在一定意义上可反映呼吸机能的潜在能力。健康状况愈好的人肺活量愈大，成年男子肺活量约为3500毫升，女子约为2500毫升。壮年人的肺活量最大，幼年和老年人较小。由于肺活量的测定方法简单，重复性较好，故是健康检查常用的指标。肺活量明显减小是限制性通气障碍的表现。肺组织损害如肺结核、肺纤维化、肺不张或肺叶切除达一定程度时都可能使肺活量减小；脊柱后凸，胸膜增厚，渗出性胸膜炎或气胸等，也可使肺扩张受限，肺活量减小',
					},
					{
						name: '胸部CT',
						price: 0,
						according:
							'检查肺、气管、支气管、纵膈、胸膜、胸壁等部位的炎症，扩张、狭窄、阻塞、肥厚、淋巴结肿大、占位性病变等',
					},
				],
			},
			{
				name: '甲状腺结节',
				children: [
					{
						name: '甲功五项',
						price: 0,
						according:
							'甲状腺素（T4）、三碘甲状腺原氨酸（T3）、促甲状腺素、游离T3、游离T4;通过血液检测可筛查人体甲状腺功能状态，是否有甲低或甲亢',
					},
					{
						name: '甲状腺彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可筛查甲状腺肿、甲状腺囊肿、甲状腺炎、甲状腺瘤、甲状腺癌等疾病',
					},
				],
			},
			{
				name: '甲状腺滤泡囊肿',
				children: [
					{
						name: '甲功五项',
						price: 0,
						according:
							'甲状腺素（T4）、三碘甲状腺原氨酸（T3）、促甲状腺素、游离T3、游离T4;通过血液检测可筛查人体甲状腺功能状态，是否有甲低或甲亢',
					},
					{
						name: '甲状腺彩超',
						price: 0,
						according:
							'通过彩色超声影像检查可筛查甲状腺肿、甲状腺囊肿、甲状腺炎、甲状腺瘤、甲状腺癌等疾病',
					},
				],
			},
			{
				name: '乳腺结节',
				children: [
					{
						name: '乳腺钼靶',
						price: 0,
						according:
							'通过彩色超声影像检查可筛查甲状腺肿、甲状腺囊肿、甲状腺炎、甲状腺瘤、甲状腺癌等疾病',
					},
					{
						name: 'CA153',
						price: 0,
						according:
							'是乳腺癌的主要标志物，对乳腺癌的敏感性和特异性较高，主要用于跟踪乳腺癌的病情发展和治疗效果的观察',
					},
				],
			},
			{
				name: '子宫肌瘤',
				children: [
					{
						name: '液基细胞（TCT）',
						price: 0,
						according:
							'宫颈薄层细胞学检查是筛查宫颈癌的最有效方法。该检测方法大大减少了由于血液、粘液、炎症而造成的模糊子宫颈细胞样本的数量，从而大大提高了妇女宫颈癌早期病变的检出率',
					},
					{
						name: '人乳头状瘤病毒HPV',
						price: 0,
						according:
							'HPV感染是引起宫颈癌变的首要因素。有效地开展HPV基因分型检测，可以有效降低宫颈癌的发病率和死亡率',
					},
				],
			},
			{
				name: '慢性宫颈炎',
				children: [
					{
						name: '液基细胞（TCT）',
						price: 0,
						according:
							'宫颈薄层细胞学检查是筛查宫颈癌的最有效方法。该检测方法大大减少了由于血液、粘液、炎症而造成的模糊子宫颈细胞样本的数量，从而大大提高了妇女宫颈癌早期病变的检出率',
					},
					{
						name: '人乳头状瘤病毒HPV',
						price: 0,
						according:
							'HPV感染是引起宫颈癌变的首要因素。有效地开展HPV基因分型检测，可以有效降低宫颈癌的发病率和死亡率',
					},
				],
			},
			{
				name: '宫颈囊肿',
				children: [
					{
						name: '液基细胞（TCT）',
						price: 0,
						according:
							'宫颈薄层细胞学检查是筛查宫颈癌的最有效方法。该检测方法大大减少了由于血液、粘液、炎症而造成的模糊子宫颈细胞样本的数量，从而大大提高了妇女宫颈癌早期病变的检出率',
					},
					{
						name: '人乳头状瘤病毒HPV',
						price: 0,
						according:
							'HPV感染是引起宫颈癌变的首要因素。有效地开展HPV基因分型检测，可以有效降低宫颈癌的发病率和死亡率',
					},
				],
			},
			{
				name: 'C13呼气试验阳性',
				children: [
					{
						name: '尿素碳13呼吸试验检测',
						price: 0,
						according:
							'尿素碳13呼吸试验是最敏感、特异性最高、无创、可定性和定量的检测胃幽门螺杆菌感染的与否的首选方法。无任何放射性，尤其适合儿童、孕妇及年老体弱群体',
					},
					{
						name: '电子胃镜',
						price: 0,
						according:
							'可以直接观察食道、胃和十二指肠的病变，尤其对微小的病变',
					},
				],
			},
			{
				name: '贫血',
				children: [
					{
						name: '贫血系列',
						price: 0,
						according: '了解贫血性质及程度（铁蛋白、叶酸、B12）',
					},
				],
			},
			{
				name: '骨量减少',
				children: [
					{
						name: '骨密度',
						price: 0,
						according: '有无骨量减少、骨质疏松',
					},
					{
						name: '微量元素五项',
						price: 0,
						according:
							'钙、镁、铁、锌、铜等五项微量元素;通过血液检查可了解人体中必需的元素是否保持恒定水平，含量过多或缺乏都能引起某些疾病的发生',
					},
					{
						name: '维生素D3',
						price: 0,
						according: '是一种脂溶性维生素，与钙、磷代谢有关。',
					},
				],
			},
		],
	},
];
var optionsArr = [];
function setRow(x1, y1, x2, y2) {
	var range = { s: { c: x1, r: y1 }, e: { c: x2, r: y2 } };
	optionsArr.push(range);
}

var num = 0 - 1;
var dataArr = [];
var rownum = 0;
private_obj.map((item, index) => {
	item.children.map((item1) => {
		rownum += item1.children.length;
		item1.children.map((item2) => {
			var arr = [];
			arr = arr.concat(
				item.name,
				item1.name,
				item2.name
				// item2.according
			);
			dataArr.push(arr);
		});
		setRow(1, num + 1, 1, num + item1.children.length);
		num += item1.children.length;
	});
	console.log(rownum - 1);
	// setRow(1, rownum + 1, 1, rownum);
});

setRow(0, 0, 0, 25);
setRow(0, 26, 0, 36);
setRow(0, 37, 0, 98);
const options = {
	'!merges': optionsArr,
	'!cols': [{ wch: 20 }, { wch: 20 }, { wch: 20 }, { wch: 20 }, { wch: 60 }],
};
console.log(dataArr)
var sheets1 = [
	{
		name: 'sheets',
		data: dataArr,
		options: options,
	},
];

fs.writeFileSync('./test.xlsx', nodeXlsx.build(sheets1), 'binary');
// fs.readFile('./1-2.xlsx', (err, files) => {
// 	if (err) console.log(err);
// 	// console.log(files.toString());
// 	fs.writeFile('./test.json', files.toString(), (err, data) => {
// 		console.log('write success');
// 	});
// });

// var sheets = nodeXlsx.parse(
// 	fs.readFileSync(path.join(__dirname, './1-1.xlsx'))
// );
// sheets[0].data.map((item, index) => {
// 	if (typeof item[1] !== 'string') {
// 		console.log(index);
// 	}
// });

// console.log(sheets[0].data.length);
// fs.writeFile(
// 	`test.json`,
// 	JSON.stringify([sheets[0].data[0], sheets[0].data[1]]),
// 	(res) => {
// 		console.log('write success');
// 	}
// );

// var spawn = require('child_process').spawn;
// var grep = spawn('grep', ['ssh']);

// console.log('Spawned child pid: ' + grep.pid);
// grep.stdin.end();
// 异步执行
// exec('python ./public/web.py', function (error, stdout, stderr) {
// 	if (error) {
// 		console.info('stderr : ' + stderr);
// 	}
// 	console.log('exec: ' + stdout);
// });
// // 同步执行
// const output = execSync('python web.py');
// console.log('sync: ' + output.toString());

// data format
// const data = [
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5],
// ];
// const range = { s: { c: 0, r: 0 }, e: { c: 0, r: 1 } }; // A1:A4
// const range1 = { s: { c: 0, r: 2 }, e: { c: 0, r: 3 } }; // A1:A4
// const options = { '!merges': [range, range1] };

// var buffer = xlsx.build([{ name: 'mySheetName', data: data }], options);

// fs.writeFileSync('./1234.xlsx', buffer, 'binary');

// var sheets = xlsx.parse(fs.readFileSync(path.join(__dirname, './1.xlsx')));

// fs.writeFile(`test.json`, JSON.stringify(sheets), (res) => {
// 	console.log('write success');
// });
